tap "koekeishiya/formulae"
tap "oven-sh/bun"
tap "productdevbook/tap"
tap "tw93/tap"

brew "git"
brew "difftastic"
brew "git-delta"
brew "ripgrep"
brew "fd"
brew "eza"
brew "just" # command runner
brew "genact" # nonsense activity generator -- pretend to be busy
brew "gum"  # markdown renderer
brew "chafa"  # terminal image renderer
brew "imagemagick"  # image file processor
brew "sox"  # audio file processor
brew "ffmpeg"  # video file processor
brew "wrk"  # HTTP benchmarking tool
brew "flamegraph"  # convert profile log to flamegraph
brew "ouch"  # compressing and decompressing
brew "caddy" # web server with automatic HTTPS
brew "exiftool"
brew "fish"
brew "starship"
brew "jq"
brew "ast-grep"
brew "task" # todo list
brew "tokei"  # code line summary
brew "vhs"  # generate GIFs with terminal code
brew "mole" # deep cleaning
brew "bat"
brew "zoxide"
brew "fzf"
brew "tlrc"  # community effort man page
brew "tmux"
brew "btop"
brew "watch"
brew "gh"
brew "glab"
brew "yazi"
brew "lazygit"
brew "skhd"
brew "yabai"
brew "node"
brew "corepack"
brew "bun"
brew "stylua"
brew "shfmt"
brew "golangci-lint"
brew "selene"
brew "shellcheck"
brew "uv"
brew "lua"
brew "luarocks"
brew "luacheck"
brew "python3"
brew "python-setuptools"
brew "rustup"
brew "golang"
brew "ruby"
brew "tree-sitter-cli"
brew "neovim"

cask "font-hack-nerd-font"
cask "font-cascadia-mono"
cask "ghostty"
cask "alacritty"
cask "kitty"
cask "neovide-app"
cask "zed"
cask "scroll-reverser"
cask "karabiner-elements"
cask "raycast"
cask "alfred"
cask "cleanshot"
cask "alt-tab"
cask "portkiller"
cask "clash-verge-rev"
cask "keka"
cask "typora"
cask "arc"
cask "firefox@developer-edition"
cask "google-chrome"
cask "iina"
cask "folo"
cask "figma"
cask "blender"
cask "adobe-creative-cloud"
cask "qq"
cask "qqmusic"
cask "wechat"
cask "baidunetdisk"
