tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
tap "jesseduffield/lazygit"
tap "oven-sh/bun"
brew "git"
brew "difftastic"
brew "git-delta"
brew "make"
brew "cmake"
brew "llvm"
brew "curl"
brew "gpg2"
brew "ripgrep"
brew "fd"
brew "ninja"
brew "eza"
brew "gum"
brew "sox"
brew "wrk"
brew "fish"
brew "fisher"
brew "jd"
brew "jq"
brew "tokei"
brew "bat"
brew "zoxide"
brew "fzf"
brew "tldr"
brew "tmux"
brew "btop"
brew "watch"
brew "yazi"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "oven-sh/bun/bun"
brew "pnpm"
brew "stylua"
brew "shfmt"
brew "golangci-lint"
brew "selene"
brew "shellcheck"
brew "lua"
brew "luarocks"
brew "luacheck"
brew "python3"
brew "python-setuptools"
brew "rustup-init"
brew "golang"
brew "neovim"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-cascadia-mono"
cask "alacritty"
cask "kitty"
cask "neovide"
cask "zed"
cask "visual-studio-code"
cask "scroll-reverser"
cask "karabiner-elements"
cask "raycast"
cask "cleanshot"
cask "bartender"
cask "arc"
cask "firefox@developer-edition"
cask "google-chrome"
cask "qq"
cask "qqmusic"
cask "wechat"
cask "iina"
